CSI API ETABS v1

# cLoadCasesModHistLinear Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cCaseModalHistoryLinear ModHistLinear { get; }

    ReadOnly Property ModHistLinear As cCaseModalHistoryLinear
    	Get

    Dim instance As cLoadCases
    Dim value As cCaseModalHistoryLinear

    value = instance.ModHistLinear

    property cCaseModalHistoryLinear^ ModHistLinear {
    	cCaseModalHistoryLinear^ get ();
    }

    abstract ModHistLinear : cCaseModalHistoryLinear with get

#### Property Value

Type: cCaseModalHistoryLinear

See Also

#### Reference

cLoadCases Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com